app/controllers/nonprofits_controller.rb

  def create
    donation = params.require(:donation).permit(:name, :amount)
    nonprofit = current_user.nonprofits.create(donation)
---
INSERT INTO "nonprofits" ("amount", "created_at", "name", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["amount", "5"], ["created_at", Wed, 07 May 2014 02:25:41 UTC +00:00], ["name", "ODD FELLOWS HALL CO OF DEERING OF IOOF 6"], ["updated_at", Wed, 07 May 2014 02:25:41 UTC +00:00], ["user_id", 1]]

  def show
    @nonprofits_search = Nonprofit.where(:user_id => current_user.id)
---
SELECT "nonprofits".* FROM "nonprofits" WHERE "nonprofits"."user_id" = 1